apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_tim.c
/****************************************************************************
 * arch/xtensa/src/esp32s2/esp32s2_tim.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <nuttx/debug.h>
#include <stdbool.h>
#include <stdint.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>

#include "xtensa.h"
#include "espressif/esp_irq.h"
#include "esp32s2_tim.h"
#include "hardware/esp32s2_system.h"
#include "hardware/esp32s2_systimer.h"
#include "hardware/esp32s2_tim.h"

#include "soc/periph_defs.h"
#include "esp_private/periph_ctrl.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define GROUP0 0
#define GROUP1 1

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct esp32s2_tim_priv_s
{
  struct esp32s2_tim_ops_s    *ops;
  uint8_t                          gid;  /* Group instance */
  uint8_t                          tid;  /* Timer instance */
  uint8_t                      int_pri;
  uint8_t                       periph;  /* Peripheral ID */
  uint8_t                          irq;  /* Interrupt ID */
  int                           cpuint;  /* CPU interrupt assigned to this timer */
  bool                           inuse;  /* Flag indicating if the timer is in use */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* TIM operations ***********************************************************/

static void esp32s2_tim_start(struct esp32s2_tim_dev_s *dev);
static void esp32s2_tim_stop(struct esp32s2_tim_dev_s *dev);
static void esp32s2_tim_clear(struct esp32s2_tim_dev_s *dev);
static void esp32s2_tim_setmode(struct esp32s2_tim_dev_s *dev,
                                enum esp32s2_tim_mode_e mode);
static void esp32s2_tim_setclksrc(struct esp32s2_tim_dev_s *dev,
                                  enum esp32s2_tim_clksrc_e src);
static void esp32s2_tim_setpre(struct esp32s2_tim_dev_s *dev,
                               uint16_t pre);
static void esp32s2_tim_setstep(struct esp32s2_tim_dev_s *dev,
                                enum esp32s2_tim_clksrc_e src,
                                uint16_t ticks);
static void esp32s2_tim_getcounter(struct esp32s2_tim_dev_s *dev,
                                   uint64_t *value);
static void esp32s2_tim_setcounter(struct esp32s2_tim_dev_s *dev,
                                   uint64_t value);
static void esp32s2_tim_reload_now(struct esp32s2_tim_dev_s *dev);
static void esp32s2_tim_getalarmvalue(struct esp32s2_tim_dev_s *dev,
                                      uint64_t *value);
static void esp32s2_tim_getperiod(struct esp32s2_tim_dev_s *dev,
                                  uint32_t *value);
static void esp32s2_tim_setalarmvalue(struct esp32s2_tim_dev_s *dev,
                                      uint64_t value);
static void esp32s2_tim_setperiod(struct esp32s2_tim_dev_s *dev,
                                  uint32_t value);
static void esp32s2_tim_setworkmode(struct esp32s2_tim_dev_s *dev,
                                    enum esp32s2_tim_work_mode_e mode);
static void esp32s2_tim_setalarm(struct esp32s2_tim_dev_s *dev,
                                 bool enable);
static void esp32s2_tim_setautoreload(struct esp32s2_tim_dev_s *dev,
                                      bool enable);
static int esp32s2_tim_setisr(struct esp32s2_tim_dev_s *dev,
                              xcpt_t handler, void * arg);
static void esp32s2_tim_enableint(struct esp32s2_tim_dev_s *dev);
static void esp32s2_tim_disableint(struct esp32s2_tim_dev_s *dev);
static void esp32s2_tim_ackint(struct esp32s2_tim_dev_s *dev);
static int  esp32s2_tim_checkint(struct esp32s2_tim_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* ESP32-S2 TIM ops */

struct esp32s2_tim_ops_s esp32s2_tim_ops =
{
  .start         = esp32s2_tim_start,
  .stop          = esp32s2_tim_stop,
  .clear         = esp32s2_tim_clear,
  .setmode       = esp32s2_tim_setmode,
  .getcounter    = esp32s2_tim_getcounter,
  .setclksrc     = esp32s2_tim_setclksrc,
  .setpre        = esp32s2_tim_setpre,
  .setstep       = NULL,
  .setcounter    = esp32s2_tim_setcounter,
  .reloadnow     = esp32s2_tim_reload_now,
  .getalarmvalue = esp32s2_tim_getalarmvalue,
  .getperiod     = NULL,
  .setalarmvalue = esp32s2_tim_setalarmvalue,
  .setperiod     = NULL,
  .setworkmode   = NULL,
  .setalarm      = esp32s2_tim_setalarm,
  .setautoreload = esp32s2_tim_setautoreload,
  .setisr        = esp32s2_tim_setisr,
  .enableint     = esp32s2_tim_enableint,
  .disableint    = esp32s2_tim_disableint,
  .ackint        = esp32s2_tim_ackint,
  .checkint      = esp32s2_tim_checkint
};

/* ESP32S2 SYSTIMER ops */

