apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_tim.c
struct esp32s2_tim_ops_s esp32s2_systim_ops =
{
  .start         = NULL,  /* Systimer doesn't support releasing counter */
  .stop          = NULL,  /* Systimer doesn't support halting counter */
  .clear         = esp32s2_tim_clear,
  .setmode       = NULL,
  .getcounter    = esp32s2_tim_getcounter,
  .setclksrc     = NULL,
  .setpre        = NULL,
  .setstep       = esp32s2_tim_setstep,
  .setcounter    = esp32s2_tim_setcounter,
  .reloadnow     = esp32s2_tim_reload_now,
  .getalarmvalue = esp32s2_tim_getalarmvalue,
  .getperiod     = esp32s2_tim_getperiod,
  .setalarmvalue = esp32s2_tim_setalarmvalue,
  .setperiod     = esp32s2_tim_setperiod,
  .setworkmode   = esp32s2_tim_setworkmode,
  .setalarm      = esp32s2_tim_setalarm,
  .setautoreload = NULL,
  .setisr        = esp32s2_tim_setisr,
  .enableint     = esp32s2_tim_enableint,
  .disableint    = esp32s2_tim_disableint,
  .ackint        = esp32s2_tim_ackint,
  .checkint      = esp32s2_tim_checkint
};

#ifdef CONFIG_ESP32S2_TIMER0

/* TIMER0 */

struct esp32s2_tim_priv_s g_esp32s2_tim0_priv =
{
  .ops        = &esp32s2_tim_ops,
  .gid        = GROUP0,
  .tid        = TIMER0,
  .int_pri    = ESP32S2_INT_PRIO_DEF,
  .periph     = ESP32S2_PERIPH_TG_T0_LEVEL, /* Peripheral ID */
  .irq        = ESP32S2_IRQ_TG_T0_LEVEL,    /* Interrupt ID */
  .cpuint     = -ENOMEM,                    /* CPU interrupt assigned to this timer */
  .inuse      = false,
};
#endif

#ifdef CONFIG_ESP32S2_TIMER1
/* TIMER1 */

struct esp32s2_tim_priv_s g_esp32s2_tim1_priv =
{
  .ops        = &esp32s2_tim_ops,
  .gid        = GROUP0,
  .tid        = TIMER1,
  .int_pri    = ESP32S2_INT_PRIO_DEF,
  .periph     = ESP32S2_PERIPH_TG_T1_LEVEL, /* Peripheral ID */
  .irq        = ESP32S2_IRQ_TG_T1_LEVEL,    /* Interrupt ID */
  .cpuint     = -ENOMEM,                    /* CPU interrupt assigned to this timer */
  .inuse      = false,
};
#endif

#ifdef CONFIG_ESP32S2_TIMER2
/* TIMER2 */

struct esp32s2_tim_priv_s g_esp32s2_tim2_priv =
{
  .ops        = &esp32s2_tim_ops,
  .gid        = GROUP1,
  .tid        = TIMER0,
  .int_pri    = ESP32S2_INT_PRIO_DEF,
  .periph     = ESP32S2_PERIPH_TG1_T0_LEVEL, /* Peripheral ID */
  .irq        = ESP32S2_IRQ_TG1_T0_LEVEL,    /* Interrupt ID */
  .cpuint     = -ENOMEM,                     /* CPU interrupt assigned to this timer */
  .inuse      = false,
};
#endif

#ifdef CONFIG_ESP32S2_TIMER3
/* TIMER3 */

struct esp32s2_tim_priv_s g_esp32s2_tim3_priv =
{
  .ops        = &esp32s2_tim_ops,
  .gid        = GROUP1,
  .tid        = TIMER1,
  .int_pri    = ESP32S2_INT_PRIO_DEF,
  .periph     = ESP32S2_PERIPH_TG1_T1_LEVEL, /* Peripheral ID */
  .irq        = ESP32S2_IRQ_TG1_T1_LEVEL,    /* Interrupt ID */
  .cpuint     = -ENOMEM,                     /* CPU interrupt assigned to this timer */
  .inuse      = false,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s2_tim_start
 *
 * Description:
 *   Release the counter.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void esp32s2_tim_start(struct esp32s2_tim_dev_s *dev)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->tid == TIMER0)
    {
      modifyreg32(TIMG_T0CONFIG_REG(priv->gid), 0, TIMG_T0_EN_M);
    }
  else
    {
      modifyreg32(TIMG_T1CONFIG_REG(priv->gid), 0, TIMG_T1_EN_M);
    }
}

/****************************************************************************
 * Name: esp32s2_tim_stop
 *
 * Description:
 *   Halt the counter.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void esp32s2_tim_stop(struct esp32s2_tim_dev_s *dev)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->tid == TIMER0)
    {
      modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_EN_M, 0);
    }
  else
    {
      modifyreg32(TIMG_T1CONFIG_REG(priv->gid), TIMG_T1_EN_M, 0);
    }
}

/****************************************************************************
 * Name: esp32s2_tim_clear
 *
 * Description:
 *   Set the counter to zero instantly.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void esp32s2_tim_clear(struct esp32s2_tim_dev_s *dev)
{
  uint64_t clear_value = 0;

  DEBUGASSERT(dev);

  esp32s2_tim_setcounter(dev, clear_value);
  esp32s2_tim_reload_now(dev);
}

/****************************************************************************
 * Name: esp32s2_tim_setmode
 *
 * Description:
 *   Set counter mode.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   mode          - Variable indicating the counting direction (up/down).
 *
 ****************************************************************************/

static void esp32s2_tim_setmode(struct esp32s2_tim_dev_s *dev,
                                enum esp32s2_tim_mode_e mode)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  if (mode == ESP32S2_TIM_MODE_DOWN)
    {
      if (priv->tid == TIMER0)
        {
          modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_INCREASE_M, 0);
        }
      else
        {
          modifyreg32(TIMG_T1CONFIG_REG(priv->gid), TIMG_T1_INCREASE_M, 0);
        }
    }
  else if (mode == ESP32S2_TIM_MODE_UP)
    {
      if (priv->tid == TIMER0)
        {
          modifyreg32(TIMG_T0CONFIG_REG(priv->gid), 0, TIMG_T0_INCREASE_M);
        }
      else
        {
          modifyreg32(TIMG_T1CONFIG_REG(priv->gid), 0, TIMG_T1_INCREASE_M);
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_setclksrc
 *
 * Description:
 *   Set CLK source.
 *   NOTE: It's not necessary to configure each timer's register for clock,
 *   because it doesn't matter which timer is configured, the clock
 *   configuration will apply to the timer group.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   src           - The source, it may be APB_CLK or XTAL_CLK.
 *
 ****************************************************************************/

static void esp32s2_tim_setclksrc(struct esp32s2_tim_dev_s *dev,
                                  enum esp32s2_tim_clksrc_e src)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  if (src == ESP32S2_TIM_APB_CLK)
    {
      modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_USE_XTAL_M, 0);
    }
  else if(src == ESP32S2_TIM_XTAL_CLK)
    {
      modifyreg32(TIMG_T0CONFIG_REG(priv->gid), 0, TIMG_T0_USE_XTAL_M);
    }
}

/****************************************************************************
 * Name: esp32s2_tim_setpre
 *
 * Description:
 *    Set the prescaler.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   pre           - This is the division factor. This variable accepts
 *                   values from 0 to 65535. If pre = 0, the division factor
 *                   is 65536, if pre = 1 or 2, the division factor is 2.
 *
 ****************************************************************************/

static void esp32s2_tim_setpre(struct esp32s2_tim_dev_s *dev,
                               uint16_t pre)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;
  uint32_t mask = (uint32_t)pre << TIMG_T0_DIVIDER_S;

  DEBUGASSERT(dev);

  if (priv->tid == TIMER0)
    {
      modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_DIVIDER_M, mask);
    }
  else
    {
      modifyreg32(TIMG_T1CONFIG_REG(priv->gid), TIMG_T1_DIVIDER_M, mask);
    }
}

/****************************************************************************
 * Name: esp32s2_tim_setstep
 *
 * Description:
 *    Set the timer increment step, i.e, defines the time interval in ticks
 *    used by the counter.
 *    NOTE: dev pointer is not used because this feature is not available
 *    for Generic Timers and it doesn't rely in any systimer comparator.
 *
 * Parameters:
 *   src           - Define the clock source for the ticks.
 *   ticks         - Number of ticks to define 1 increment step.
 *
 ****************************************************************************/

static void esp32s2_tim_setstep(struct esp32s2_tim_dev_s *dev,
                                enum esp32s2_tim_clksrc_e src,
                                uint16_t ticks)
{
  if (src == ESP32S2_TIM_PLL_CLK)
    {
      REG_SET_FIELD(SYSTIMER_STEP_REG, SYSTIMER_TIMER_PLL_STEP,
                    ticks & SYSTIMER_TIMER_PLL_STEP_V);
    }
  else if(src == ESP32S2_TIM_XTAL_CLK)
    {
      REG_SET_FIELD(SYSTIMER_STEP_REG, SYSTIMER_TIMER_XTAL_STEP,
                    ticks & SYSTIMER_TIMER_XTAL_STEP_V);
    }
}

/****************************************************************************
 * Name: esp32s2_tim_getcounter
 *
 * Description:
 *   Get the current counter value.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - A pointer to a variable to store the current read
 *                   value from counter.
 *
 ****************************************************************************/

static void esp32s2_tim_getcounter(struct esp32s2_tim_dev_s *dev,
                                   uint64_t *value)
{
  uint32_t value_32;
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  *value = 0;
  if (priv->tid == SYSTIMER_COMP0)
    {
      /* Latch counter */

      modifyreg32(SYSTIMER_UPDATE_REG, 0, SYSTIMER_TIMER_UPDATE);

      /* Wait until result is ready */

      while (!REG_GET_FIELD(SYSTIMER_UPDATE_REG,
             SYSTIMER_TIMER_VALUE_VALID));

      /* Read value */

