apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_tim.c
      value_32  = getreg32(SYSTIMER_VALUE_HI_REG); /* High 32 bits */
      *value   |= value_32;
      *value  <<= SHIFT_32;
      value_32  = getreg32(SYSTIMER_VALUE_LO_REG); /* Low 32 bits */
      *value   |= value_32;
    }
  else
    {
      if (priv->tid == TIMER0)
        {
          /* Dummy value (0 or 1) to latch the counter value to read it */

          putreg32(BIT(0), TIMG_T0UPDATE_REG(priv->gid));

          /* Read value */

          value_32  = getreg32(TIMG_T0HI_REG(priv->gid)); /* High 32 bits */
          *value   |= value_32;
          *value  <<= SHIFT_32;
          value_32  = getreg32(TIMG_T0LO_REG(priv->gid)); /* Low 32 bits */
          *value   |= value_32;
        }
      else
        {
          /* Dummy value (0 or 1) to latch the counter value to read it */

          putreg32(BIT(0), TIMG_T1UPDATE_REG(priv->gid));

          /* Read value */

          value_32  = getreg32(TIMG_T1HI_REG(priv->gid)); /* High 32 bits */
          *value   |= value_32;
          *value  <<= SHIFT_32;
          value_32  = getreg32(TIMG_T1LO_REG(priv->gid)); /* Low 32 bits */
          *value   |= value_32;
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_setcounter
 *
 * Description:
 *   Set the value to be loaded to the counter.
 *   If you want the counter to be loaded at an alarm, enable the alarm and
 *   the auto-reload before.
 *   If you want the counter to be loaded instantly, call
 *   esp32s2_tim_reload_now() after this function.
 *   NOTE: Systimer has 1 counter for 3 comparators.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - The value to be loaded the counter.
 *
 ****************************************************************************/

static void esp32s2_tim_setcounter(struct esp32s2_tim_dev_s *dev,
                                   uint64_t value)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;
  uint64_t low_64 = value & UINT32_MAX;
  uint64_t high_64 = (value >> SHIFT_32);

  DEBUGASSERT(dev);

  /* Set the counter value */

  if (priv->tid == SYSTIMER_COMP0)
    {
      putreg32((uint32_t)low_64, SYSTIMER_LOAD_LO_REG);
      putreg32((uint32_t)high_64, SYSTIMER_LOAD_HI_REG);
    }
  else
    {
      if (priv->tid == TIMER0)
        {
          putreg32((uint32_t)low_64, TIMG_T0LOADLO_REG(priv->gid));
          putreg32((uint32_t)high_64, TIMG_T0LOADHI_REG(priv->gid));
        }
      else
        {
          putreg32((uint32_t)low_64, TIMG_T1LOADLO_REG(priv->gid));
          putreg32((uint32_t)high_64, TIMG_T1LOADHI_REG(priv->gid));
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_reload_now
 *
 * Description:
 *   Reload the counter instantly. It may be called after
 *   esp32s2_tim_setcounter().
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void esp32s2_tim_reload_now(struct esp32s2_tim_dev_s *dev)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  /* Dummy value to trigger reloading  */

  if (priv->tid == SYSTIMER_COMP0)
    {
      putreg32(BIT(31), SYSTIMER_LOAD_REG);
    }
  else
    {
      if (priv->tid == TIMER0)
        {
          putreg32(BIT(0), TIMG_T0LOAD_REG(priv->gid));
        }
      else
        {
          putreg32(BIT(0), TIMG_T1LOAD_REG(priv->gid));
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_getalarmvalue
 *
 * Description:
 *   Get the alarm value.
 *   NOTE: For systimer, the returned alarm value is the Time-Delay Alarm.
 *   See TRM for more details.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - Pointer to retrieve the current configured alarm value.
 *
 ****************************************************************************/

static void esp32s2_tim_getalarmvalue(struct esp32s2_tim_dev_s *dev,
                                      uint64_t *value)
{
  uint32_t value_32;
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  *value = 0;

  /* Read value */

  if (priv->tid == SYSTIMER_COMP0)
    {
      value_32  = getreg32(SYSTIMER_TARGET0_HI_REG); /* High 32 bits */
      *value   |= value_32;
      *value  <<= SHIFT_32;
      value_32  = getreg32(SYSTIMER_TARGET0_LO_REG); /* Low 32 bits */
      *value   |= value_32;
    }
  else
    {
      if (priv->tid == TIMER0)
        {
          value_32  = getreg32(TIMG_T0ALARMHI_REG(priv->gid)); /* High 32 bits */
          *value   |= value_32;
          *value  <<= SHIFT_32;
          value_32  = getreg32(TIMG_T0ALARMLO_REG(priv->gid)); /* Low 32 bits */
          *value   |= value_32;
        }
      else
        {
          value_32  = getreg32(TIMG_T1ALARMHI_REG(priv->gid)); /* High 32 bits */
          *value   |= value_32;
          *value  <<= SHIFT_32;
          value_32  = getreg32(TIMG_T1ALARMLO_REG(priv->gid)); /* Low 32 bits */
          *value   |= value_32;
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_getperiod
 *
 * Description:
 *   This function is only available for Systimer. And it's intended to get
 *   the alarm when it's working on periodic mode.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - Pointer to retrieve the current configured alarm value.
 *
 ****************************************************************************/

static void esp32s2_tim_getperiod(struct esp32s2_tim_dev_s *dev,
                                  uint32_t *value)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  *value = 0;

  /* Read value */

  if (priv->tid == SYSTIMER_COMP0)
    {
      *value  = REG_GET_FIELD(SYSTIMER_TARGET0_CONF_REG,
                              SYSTIMER_TARGET0_PERIOD);
    }
}

/****************************************************************************
 * Name: esp32s2_tim_setalarmvalue
 *
 * Description:
 *   Set the value that will trigger an alarm when the
 *   counter value matches this value.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - The alarm value.
 *
 ****************************************************************************/

static void esp32s2_tim_setalarmvalue(struct esp32s2_tim_dev_s *dev,
                                      uint64_t value)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;
  uint64_t low_64  = value & UINT32_MAX;
  uint64_t high_64 = (value >> SHIFT_32);

  DEBUGASSERT(dev);

