apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_tim.c
  /* Set an alarm value */

  if (priv->tid == SYSTIMER_COMP0)
    {
      putreg32((uint32_t)low_64, SYSTIMER_TARGET0_LO_REG);
      putreg32((uint32_t)high_64, SYSTIMER_TARGET0_HI_REG);
    }
  else
    {
      if (priv->tid == TIMER0)
        {
          putreg32((uint32_t)low_64, TIMG_T0ALARMLO_REG(priv->gid));
          putreg32((uint32_t)high_64, TIMG_T0ALARMHI_REG(priv->gid));
        }
      else
        {
          putreg32((uint32_t)low_64, TIMG_T1ALARMLO_REG(priv->gid));
          putreg32((uint32_t)high_64, TIMG_T1ALARMHI_REG(priv->gid));
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_setperiod
 *
 * Description:
 *   This function is only available for Systimer. And it's intended to set
 *   the alarm when it's working on periodic mode.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - Period value.
 *
 ****************************************************************************/

static void esp32s2_tim_setperiod(struct esp32s2_tim_dev_s *dev,
                                  uint32_t value)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  /* Read value */

  if (priv->tid == SYSTIMER_COMP0)
    {
      REG_SET_FIELD(SYSTIMER_TARGET0_CONF_REG,
                    SYSTIMER_TARGET0_PERIOD, value);
    }
}

/****************************************************************************
 * Name: esp32s2_tim_setworkmode
 *
 * Description:
 *   This function is only available for Systimer. And it's intended to set
 *   the work mode: Time-Delay alarm mode or periodic alarm mode.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   value         - Period value.
 *
 ****************************************************************************/

static void esp32s2_tim_setworkmode(struct esp32s2_tim_dev_s *dev,
                                    enum esp32s2_tim_work_mode_e mode)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  /* Read value */

  if (priv->tid == SYSTIMER_COMP0)
    {
      REG_SET_FIELD(SYSTIMER_TARGET0_CONF_REG,
                    SYSTIMER_TARGET0_PERIOD_MODE, mode);
    }
}

/****************************************************************************
 * Name: esp32s2_tim_setalarm
 *
 * Description:
 *   Enable/Disable the alarm.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   enable        - A variable to indicate the action. If true, enable
 *                   the alarm, if false, disable it.
 *
 ****************************************************************************/

static void esp32s2_tim_setalarm(struct esp32s2_tim_dev_s *dev,
                                 bool enable)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->tid == SYSTIMER_COMP0)
    {
      if (enable)
        {
          modifyreg32(SYSTIMER_TARGET0_CONF_REG, 0,
                      SYSTIMER_TARGET0_WORK_EN);
        }
      else
        {
          modifyreg32(SYSTIMER_TARGET0_CONF_REG,
                      SYSTIMER_TARGET0_WORK_EN, 0);
        }
    }
  else
    {
      if (priv->tid == TIMER0)
        {
          if (enable)
            {
              modifyreg32(TIMG_T0CONFIG_REG(priv->gid), 0,
                          TIMG_T0_ALARM_EN_M);
            }
          else
            {
              modifyreg32(TIMG_T0CONFIG_REG(priv->gid),
                          TIMG_T0_ALARM_EN_M, 0);
            }
        }
      else
        {
          if (enable)
            {
              modifyreg32(TIMG_T1CONFIG_REG(priv->gid),
                          0, TIMG_T1_ALARM_EN_M);
            }
          else
            {
              modifyreg32(TIMG_T1CONFIG_REG(priv->gid),
                          TIMG_T1_ALARM_EN_M, 0);
            }
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_setautoreload
 *
 * Description:
 *   Enable or disable the auto reload.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *   enable        - A variable to indicate the action. If it is true,
 *                   enable the auto reload, if false,
 *                   disable auto reload.
 *
 ****************************************************************************/

static void esp32s2_tim_setautoreload(struct esp32s2_tim_dev_s *dev,
                                   bool enable)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->tid == TIMER0)
    {
      if (enable)
        {
          modifyreg32(TIMG_T0CONFIG_REG(priv->gid), 0, TIMG_T0_AUTORELOAD_M);
        }
      else
        {
          modifyreg32(TIMG_T0CONFIG_REG(priv->gid), TIMG_T0_AUTORELOAD_M, 0);
        }
    }
  else
    {
      if (enable)
        {
          modifyreg32(TIMG_T1CONFIG_REG(priv->gid), 0, TIMG_T1_AUTORELOAD_M);
        }
      else
        {
          modifyreg32(TIMG_T1CONFIG_REG(priv->gid), TIMG_T1_AUTORELOAD_M, 0);
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_setisr
 *
 * Description:
 *   Allocate a CPU Interrupt, connect the peripheral source to this
 *   Interrupt, register the callback and enable the CPU Interruption.
 *   In case a NULL handler is provided, deallocate the interrupt and
 *   unregister the previously provided handler.
 *
 * Parameters:
 *   dev           - Pointer to the driver state structure.
 *   handler       - Callback to be invoked on timer interrupt.
 *   arg           - Argument to be passed to the handler callback.
 *
 * Returned Values:
 *   Zero (OK) is returned on success; A negated errno value is returned
 *   to indicate the nature of any failure.
 *
 ****************************************************************************/

static int esp32s2_tim_setisr(struct esp32s2_tim_dev_s *dev,
                              xcpt_t handler, void *arg)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;
  int ret = OK;

  DEBUGASSERT(dev);

  /* Disable interrupt when callback is removed. */

  if (handler == NULL)
    {
      /* If a CPU Interrupt was previously allocated, then deallocate it */

      if (priv->cpuint != -ENOMEM)
        {
          /* Disable CPU Interrupt, free a previously allocated
           * CPU Interrupt
           */

          up_disable_irq(priv->irq);
          esp_teardown_irq(priv->periph, priv->cpuint);

          priv->cpuint = -ENOMEM;
        }
    }

  /* Otherwise set callback and enable interrupt */

  else
    {
      if (priv->cpuint != -ENOMEM)
        {
          /* Disable the previous IRQ */

          up_disable_irq(priv->irq);
        }

      if (priv->tid == SYSTIMER_COMP0)
        {
          priv->cpuint = esp_setup_irq(priv->periph, priv->int_pri,
                                       ESP_IRQ_TRIGGER_EDGE, handler, arg);
        }
      else
        {
          priv->cpuint = esp_setup_irq(priv->periph, priv->int_pri,
                                       ESP_IRQ_TRIGGER_LEVEL,
                                       handler, arg);
        }

      if (priv->cpuint < 0)
        {
          tmrerr("ERROR: No CPU Interrupt available");
          ret = priv->cpuint;
          goto errout;
        }

      /* Enable the CPU Interrupt that is linked to the timer */

      up_enable_irq(priv->irq);
    }

errout:
  return ret;
}

/****************************************************************************
 * Name: esp32s2_tim_enableint
 *
 * Description:
 *   Enable Interrupt at the alarm if it is set.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

