apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_tim.c
static void esp32s2_tim_enableint(struct esp32s2_tim_dev_s *dev)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->tid == SYSTIMER_COMP0)
    {
      modifyreg32(SYSTIMER_INT_ENA_REG, 0, SYSTIMER_SYSTIMER_INT0_ENA_M);
    }
  else
    {
      if (priv->tid == TIMER0)
        {
          modifyreg32(TIMG_T0CONFIG_REG(priv->gid), 0,
                      TIMG_T0_LEVEL_INT_EN_M);
          modifyreg32(TIMG_INT_ENA_TIMERS_REG(priv->gid), 0,
                      TIMG_T0_INT_ENA_M);
        }
      else
        {
          modifyreg32(TIMG_T1CONFIG_REG(priv->gid), 0,
                      TIMG_T1_LEVEL_INT_EN_M);
          modifyreg32(TIMG_INT_ENA_TIMERS_REG(priv->gid), 0,
                      TIMG_T1_INT_ENA_M);
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_disableint
 *
 * Description:
 *   Disable a Interrupt at the alarm if it is set.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void esp32s2_tim_disableint(struct esp32s2_tim_dev_s *dev)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->tid == SYSTIMER_COMP0)
    {
      modifyreg32(SYSTIMER_INT_ENA_REG, SYSTIMER_SYSTIMER_INT0_ENA_M, 0);
    }
  else
    {
      if (priv->tid == TIMER0)
        {
          modifyreg32(TIMG_T0CONFIG_REG(priv->gid),
                      TIMG_T0_LEVEL_INT_EN_M, 0);
          modifyreg32(TIMG_INT_ENA_TIMERS_REG(priv->gid),
                      TIMG_T0_INT_ENA_M, 0);
        }
      else
        {
          modifyreg32(TIMG_T1CONFIG_REG(priv->gid),
                      TIMG_T1_LEVEL_INT_EN_M, 0);
          modifyreg32(TIMG_INT_ENA_TIMERS_REG(priv->gid),
                      TIMG_T1_INT_ENA_M, 0);
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_ackint
 *
 * Description:
 *   Acknowledge an interrupt, that means, clear the interrupt.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

static void esp32s2_tim_ackint(struct esp32s2_tim_dev_s *dev)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->tid == SYSTIMER_COMP0)
    {
      modifyreg32(SYSTIMER_INT_CLR_REG, 0, SYSTIMER_SYSTIMER_INT0_CLR_M);
    }
  else
    {
      if (priv->tid == TIMER0)
        {
          modifyreg32(TIMG_INT_CLR_TIMERS_REG(priv->gid), 0,
                      TIMG_T0_INT_CLR_M);
        }
      else
        {
          modifyreg32(TIMG_INT_CLR_TIMERS_REG(priv->gid), 0,
                      TIMG_T1_INT_CLR_M);
        }
    }
}

/****************************************************************************
 * Name: esp32s2_tim_checkint
 *
 * Description:
 *   Check the interrupt status bit.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 * Returned Values:
 *  Return 1 in case of an interrupt is triggered, otherwise 0.
 *
 ****************************************************************************/

static int esp32s2_tim_checkint(struct esp32s2_tim_dev_s *dev)
{
  struct esp32s2_tim_priv_s *priv = (struct esp32s2_tim_priv_s *)dev;
  uint32_t reg_value;
  int ret;

  DEBUGASSERT(dev);

  if (priv->tid == SYSTIMER_COMP0)
    {
      reg_value = getreg32(SYSTIMER_INT_RAW_REG);
      ret = REG_MASK(reg_value, SYSTIMER_SYSTIMER_INT0_RAW);
    }
  else
    {
      if (priv->tid == TIMER0)
        {
          reg_value = getreg32(TIMG_INT_ST_TIMERS_REG(priv->gid));
          ret = REG_MASK(reg_value, TIMG_T0_INT_ST);
        }
      else
        {
          reg_value = getreg32(TIMG_INT_ST_TIMERS_REG(priv->gid));
          ret = REG_MASK(reg_value, TIMG_T1_INT_ST);
        }
    }

  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s2_tim_init
 *
 * Description:
 *   Initialize TIMER device.
 *
 * Parameters:
 *   timer           - Timer instance to be initialized.
 *                     Valid values: 0 or 1.
 *
 * Returned Values:
 *   If the initialization is successful, return a pointer to the timer
 *   driver struct associated to that timer instance.
 *   In case it fails, return NULL.
 *
 ****************************************************************************/

struct esp32s2_tim_dev_s *esp32s2_tim_init(int timer)
{
  struct esp32s2_tim_priv_s *tim = NULL;

  /* First, take the data structure associated with the timer instance */

  switch (timer)
    {
#ifdef CONFIG_ESP32S2_TIMER0
      case TIMER0:
        {
          tim = &g_esp32s2_tim0_priv;
          break;
        }
#endif

#ifdef CONFIG_ESP32S2_TIMER1
      case TIMER1:
        {
          tim = &g_esp32s2_tim1_priv;
          break;
        }
#endif

#ifdef CONFIG_ESP32S2_TIMER2
      case TIMER2:
        {
          tim = &g_esp32s2_tim2_priv;
          break;
        }
#endif

#ifdef CONFIG_ESP32S2_TIMER3
      case TIMER3:
        {
          tim = &g_esp32s2_tim3_priv;
          break;
        }
#endif
    }

  if (tim->gid == GROUP0)
    {
      periph_module_enable(PERIPH_TIMG0_MODULE);
    }
  else
    {
      periph_module_enable(PERIPH_TIMG1_MODULE);
    }

  /* Verify if it is in use */

  if (tim->inuse == false)
    {
      tim->inuse = true;  /* If it was not, now it is */
    }
  else
    {
      tmrerr("ERROR: TIMER %d is already in use\n", timer);
      tim = NULL;
    }

  return (struct esp32s2_tim_dev_s *)tim;
}

/****************************************************************************
 * Name: esp32s2_tim_deinit
 *
 * Description:
 *   Deinit TIMER device.
 *
 * Parameters:
 *   dev           - Pointer to the timer driver struct.
 *
 ****************************************************************************/

void esp32s2_tim_deinit(struct esp32s2_tim_dev_s *dev)
{
  struct esp32s2_tim_priv_s *tim = NULL;

  DEBUGASSERT(dev);

  tim = (struct esp32s2_tim_priv_s *)dev;
  tim->inuse = false;
}
